{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.9.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": false, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": false, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1/conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1/conv", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv1/bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv1/bn", "inbound_nodes": [[["conv1/conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv1/relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv1/relu", "inbound_nodes": [[["conv1/bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": false, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["conv1/relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_0_bn", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block1_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block1_0_relu", "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block1_1_conv", "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_1_bn", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block1_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block1_1_relu", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block1_2_conv", "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block1_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block1_concat", "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block2_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block2_0_bn", "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block2_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block2_0_relu", "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block2_1_conv", "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block2_1_bn", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block2_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block2_1_relu", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block2_2_conv", "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block2_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block2_concat", "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block3_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block3_0_bn", "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block3_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block3_0_relu", "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block3_1_conv", "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block3_1_bn", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block3_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block3_1_relu", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block3_2_conv", "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block3_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block3_concat", "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block4_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block4_0_bn", "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block4_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block4_0_relu", "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block4_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block4_1_conv", "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block4_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block4_1_bn", "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block4_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block4_1_relu", "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block4_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block4_2_conv", "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block4_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block4_concat", "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block5_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block5_0_bn", "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block5_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block5_0_relu", "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block5_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block5_1_conv", "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block5_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block5_1_bn", "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block5_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block5_1_relu", "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block5_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block5_2_conv", "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block5_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block5_concat", "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block6_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block6_0_bn", "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block6_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block6_0_relu", "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block6_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block6_1_conv", "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block6_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block6_1_bn", "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2_block6_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv2_block6_1_relu", "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block6_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block6_2_conv", "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv2_block6_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv2_block6_concat", "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "pool2_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "pool2_bn", "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "pool2_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "pool2_relu", "inbound_nodes": [[["pool2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "pool2_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pool2_conv", "inbound_nodes": [[["pool2_relu", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "pool2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool2_pool", "inbound_nodes": [[["pool2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_0_bn", "inbound_nodes": [[["pool2_pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block1_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block1_0_relu", "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block1_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block1_1_conv", "inbound_nodes": [[["conv3_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_1_bn", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block1_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block1_1_relu", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block1_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block1_2_conv", "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv3_block1_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv3_block1_concat", "inbound_nodes": [[["pool2_pool", 0, 0, {}], ["conv3_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block2_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block2_0_bn", "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block2_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block2_0_relu", "inbound_nodes": [[["conv3_block2_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block2_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block2_1_conv", "inbound_nodes": [[["conv3_block2_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block2_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block2_1_bn", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block2_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block2_1_relu", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block2_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block2_2_conv", "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv3_block2_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv3_block2_concat", "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}], ["conv3_block2_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block3_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block3_0_bn", "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block3_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block3_0_relu", "inbound_nodes": [[["conv3_block3_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block3_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block3_1_conv", "inbound_nodes": [[["conv3_block3_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block3_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block3_1_bn", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block3_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block3_1_relu", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block3_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block3_2_conv", "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv3_block3_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv3_block3_concat", "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}], ["conv3_block3_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block4_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block4_0_bn", "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block4_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block4_0_relu", "inbound_nodes": [[["conv3_block4_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block4_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block4_1_conv", "inbound_nodes": [[["conv3_block4_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block4_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block4_1_bn", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block4_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block4_1_relu", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block4_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block4_2_conv", "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv3_block4_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv3_block4_concat", "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}], ["conv3_block4_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block5_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block5_0_bn", "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block5_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block5_0_relu", "inbound_nodes": [[["conv3_block5_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block5_1_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block5_1_conv", "inbound_nodes": [[["conv3_block5_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block5_1_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block5_1_bn", "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block5_1_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block5_1_relu", "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block5_2_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block5_2_conv", "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv3_block5_concat", "trainable": false, "dtype": "float32", "axis": 3}, "name": "conv3_block5_concat", "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}], ["conv3_block5_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block6_0_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block6_0_bn", "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3_block6_0_relu", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "conv3_block6_0_relu", "inbound_nodes": [[["conv3_block6_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D",